<a href="https://colab.research.google.com/github/valentingracia/codingDojoDC/blob/main/EjerciciosGroupBy.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Alumno Valentin Gracia DataScience G1

Ejercicio2

In [174]:
from google.colab import drive
drive.mount('/content/drive')

import pandas as pd
filename = '/content/drive/MyDrive/Coding Dojo/Semana2/Callt2.csv'
Callt2_df=pd.read_csv(filename,header=None)
Callt2_df.head()

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

   0         1         2  3
0  7  07/24/05  00:00:00  0
1  9  07/24/05  00:00:00  0
2  7  07/24/05  00:30:00  1
3  9  07/24/05  00:30:00  0
4  7  07/24/05  01:00:00  0

Renombrado de columnas

In [175]:
Callt2_df.rename(columns={0:"ID_Flujo",1:"Fecha",2:"Hora",3:"Conteo"},inplace=True)
Callt2_df.head()

   ID_Flujo     Fecha      Hora  Conteo
0         7  07/24/05  00:00:00       0
1         9  07/24/05  00:00:00       0
2         7  07/24/05  00:30:00       1
3         9  07/24/05  00:30:00       0
4         7  07/24/05  01:00:00       0

Selecciona todos los datos para la fecha del 24 de Julio de 2005 que tengan un número de identificación de flujo = 7.

In [176]:
Callt2_df_flt=Callt2_df[(Callt2_df["Fecha"]=="07/24/05") & (Callt2_df["ID_Flujo"]==7)]
Callt2_df_flt.head()

   ID_Flujo     Fecha      Hora  Conteo
0         7  07/24/05  00:00:00       0
2         7  07/24/05  00:30:00       1
4         7  07/24/05  01:00:00       0
6         7  07/24/05  01:30:00       0
8         7  07/24/05  02:00:00       0

De los datos seleccionados en el paso 1, clasifica los resultados de conteo en orden descendiente y crea el formato de salida de las 10 filas superiores. Asigna el formato de salida a una variable llamada top10.

In [177]:
Callt2_df_flt=Callt2_df_flt.sort_values(by='Conteo', ascending=False, na_position='first')
top10=Callt2_df_flt.head(10)
top10

    ID_Flujo     Fecha      Hora  Conteo
72         7  07/24/05  18:00:00       4
84         7  07/24/05  21:00:00       3
76         7  07/24/05  19:00:00       2
92         7  07/24/05  23:00:00       2
30         7  07/24/05  07:30:00       2
10         7  07/24/05  02:30:00       2
86         7  07/24/05  21:30:00       2
70         7  07/24/05  17:30:00       2
68         7  07/24/05  17:00:00       1
74         7  07/24/05  18:30:00       1

Función Apply
Para las 10 filas sacadas arriba, usa la función Apply de pandas para restar el valor menor de los 10 de todos ellos y luego saca el valor promedio de los conteos resultantes.

In [178]:
top10["Conteo"].apply(lambda x: x-top10["Conteo"].min()).mean()

1.1

Agrupar
Selecciona los datos del mes de agosto 2005 que tengan una ID de flujo =7
Agrupa los datos basándose en la fecha y saca el conteo máximo por fecha.

In [179]:
Callt2AgoF7_df=Callt2_df_flt=Callt2_df[(Callt2_df["Fecha"]>="08/01/05") & (Callt2_df["Fecha"]<="08/31/05") &  (Callt2_df["ID_Flujo"]==7)]
print(Callt2AgoF7_df.head())
Callt2AgoF7_df.groupby(["Fecha"])[["Conteo"]].max()

     ID_Flujo     Fecha      Hora  Conteo
768         7  08/01/05  00:00:00       1
770         7  08/01/05  00:30:00       0
772         7  08/01/05  01:00:00       0
774         7  08/01/05  01:30:00       0
776         7  08/01/05  02:00:00       0

          Conteo
Fecha
08/01/05      18
08/02/05      16
08/03/05      26
08/04/05      40
08/05/05      17
08/06/05       8
08/07/05       3
08/08/05      16
08/09/05      19
08/10/05      25
08/11/05      16
08/12/05      21
08/13/05       5
08/14/05       3
08/15/05      17
08/16/05      24
08/17/05      22
08/18/05      39
08/19/05      23
08/20/05       3
08/21/05       4
08/22/05      23
08/23/05      25
08/24/05      17
08/25/05      24
08/26/05      22
08/27/05       3
08/28/05       7
08/29/05      15
08/30/05      47
08/31/05      19